cryptoadvance/specter-bootloader/platforms/stm32f469disco/bootloader/bl_syscalls.c
/**
 * @file       bl_syscalls.c
 * @brief      System abstraction layer for STM32F469I-DISCO platform
 * @author     Mike Tolkachev <contact@miketolkachev.dev>
 * @copyright  Copyright 2020 Crypto Advance GmbH. All rights reserved.
 *
 * System abstraction layer for STM32F469I-DISCO platform. These functions are
 * called from core of Bootloader to obtain platform parameters and to perform
 * platform-specific operations.
 *
 * Flash sector mapping is taken from the MicroPython project. Original license
 * and copyright notice are provided at the end of file.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "crc32.h"
#include "bl_util.h"
#include "bl_syscalls.h"
#include "stm32469i_discovery.h"
#include "stm32469i_discovery_sd.h"
#include "stm32469i_discovery_lcd.h"
#include "ff.h"
#include "ff_gen_drv.h"
#include "sd_diskio.h"
#include "gui.h"
#include "linker_vars.h"

/// Index of the
#define DEVICE_IDX_MICROSD 0U
/// Base address of flash memory region to which Bootloader has access
#define FLASH_WR_BASE (bl_flash_map[bl_flash_firmware_base])
/// Size of flash memory region to which Bootloader has access
#define FLASH_WR_SIZE                     \
  (bl_flash_map[bl_flash_firmware_size] + \
   2U * bl_flash_map[bl_flash_bootloader_size])
/// All flash memory error flags
#define FLASH_FLAG_ALL_ERRORS_                                                 \
  (FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | \
   FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR)
/// Error LED
#define ERROR_LED LED_RED
/// Text with request to rebbot the device
#define REBOOT_PROMPT "Press power button to reboot"
/// First sector in the Bank 1
#define FLASH_BANK2_FIRST_SECTOR 12U
/// Selection of protection mode: 0 - write protection, 1 - PCROP
#define FLASH_SPRMOD_BIT (1U << 15)

/// GPIO port of nPWR_BUTTON line
#define NPWR_BUTTON_GPIO_PORT ((GPIO_TypeDef*)GPIOB)
/// GPIO pin of nPWR_BUTTON line
#define NPWR_BUTTON_GPIO_PIN ((uint32_t)GPIO_PIN_1)
/// Enables clock to GPIO module to which nPWR_BUTTON line is connected
#define NPWR_BUTTON_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
/// GPIO port of PWR_HOLD2 line
#define PWR_HOLD2_GPIO_PORT ((GPIO_TypeDef*)GPIOB)
/// GPIO pin of PWR_HOLD2 line
#define PWR_HOLD2_GPIO_PIN ((uint32_t)GPIO_PIN_15)
/// Enables clock to GPIO module to which PWR_HOLD2 line is connected
#define PWR_HOLD2_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()

/// Prototype for the start_firmware() function
typedef bool (*blsys_start_firmware_t)(bl_addr_t, uint32_t);

/// Indexes of the media devices
typedef enum media_device_idx_t {
  media_micro_sd = 0,  ///< microSD card slot
  media_n_devices,     ///< Number of media devices, not a device index
  media_none = -1      ///< Reserved "no media" value
} media_device_idx_t;

/// Flash memory layout entry
typedef struct {
  bl_addr_t base_address;  ///< Base address of the sector
  bl_addr_t sector_size;   ///< Size of the sector
  uint32_t sector_count;   ///< Number of sectors having the same size
} flash_layout_t;

/// Area in the flash memory defined by address and size
typedef struct flash_area_t {
  bl_addr_t addr;  ///< Starting address
  size_t size;     ///< Size in bytes
} flash_area_t;

/// Iterator over sectors in the flash memory
typedef flash_area_t flash_sect_iter_t;

/// Map of flash memory sectors
typedef uint32_t sec_bitmap_t;

/// Layout of flash memory
// clang-format off
static const flash_layout_t flash_layout[] = {
  { 0x08000000, 0x04000, 4 },
  { 0x08010000, 0x10000, 1 },
  { 0x08020000, 0x20000, 3 },
  #if defined(FLASH_SECTOR_8)
  { 0x08080000, 0x20000, 4 },
  #endif
  #if defined(FLASH_SECTOR_12)
  { 0x08100000, 0x04000, 4 },
  { 0x08110000, 0x10000, 1 },
  { 0x08120000, 0x20000, 7 },
  #endif
};
// clang-format on

/// Flash memory map
// clang-format off
const bl_addr_t bl_flash_map[bl_flash_map_nitems] = {
  [bl_flash_firmware_base]         = LV_VALUE(_main_firmware_start),
  [bl_flash_firmware_size]         = LV_VALUE(_main_firmware_size),
  [bl_flash_bootloader_image_base] = LV_VALUE(_bl_image_base),
  [bl_flash_bootloader_copy1_base] = LV_VALUE(_bl_copy1_start),
  [bl_flash_bootloader_copy2_base] = LV_VALUE(_bl_copy2_start),
  [bl_flash_bootloader_size]       = LV_VALUE(_bl_sect_size)};
// clang-format on

/// Names of media devices
static const char* media_name[media_n_devices] = {[media_micro_sd] = "microSD"};

/// Statically allocated local context
static struct {
  /// File system object for currently mounted media device
  FATFS fs_obj;
  /// Media logical drive path
  char media_path[4];
  /// Currently mounted media device
  media_device_idx_t mounted_media;
} ctx;

/// Flag indicating that the system is initialized
static bool system_initialized = false;

/**
 * Returns information about flash memory sector specified by address
 *
 * @param addr        address within flash memory range
 * @param start_addr  pointer to variable receiving start address of the sector,
 *                    ignored if NULL
 * @param size        pointer to variable receiving size of the sector,
 *                    ignored if NULL
 * @return            sector index, or -1 if address is incorrect
 */
static int flash_get_sector_info(bl_addr_t addr, bl_addr_t* start_addr,
                                 bl_addr_t* size) {
  if (addr >= flash_layout[0].base_address) {
    int sector_index = 0;
    for (int i = 0; i < sizeof(flash_layout) / sizeof(flash_layout[0]); ++i) {
      for (int j = 0; j < flash_layout[i].sector_count; ++j) {
        bl_addr_t sector_start_next = flash_layout[i].base_address +
                                      (j + 1) * flash_layout[i].sector_size;
        if (addr < sector_start_next) {
          if (start_addr != NULL) {
            *start_addr =
                flash_layout[i].base_address + j * flash_layout[i].sector_size;
          }
          if (size != NULL) {
            *size = flash_layout[i].sector_size;
          }
          return sector_index;
        }
        ++sector_index;
      }
    }
  }
  return -1;
}

/**
 * Initializes the SD Detect pin
 */
static inline void sd_detect_init(void) {
  SD_DETECT_GPIO_CLK_ENABLE();

  // GPIO configuration in input for uSD_Detect signal
  GPIO_InitTypeDef pin_dsc = {.Pin = SD_DETECT_PIN,
                              .Mode = GPIO_MODE_INPUT,
                              .Pull = GPIO_PULLUP,
                              .Speed = GPIO_SPEED_HIGH};
  HAL_GPIO_Init(SD_DETECT_GPIO_PORT, &pin_dsc);
}

/**
 * Checks if SD card present in the slot using SD Detect pin
 *
 * @return true  if card present
 */
static inline bool sd_detect_state(void) {
  return HAL_GPIO_ReadPin(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) == GPIO_PIN_RESET;
}

/**
 * Returns state of power button
 *
 * @return  true if power button is pressed
 */
static bool power_btn_state(void) {
  int activation_counter = 0;
  for (int i = 0; i < 5; ++i) {  // 5ms debounce
    if (HAL_GPIO_ReadPin(NPWR_BUTTON_GPIO_PORT, NPWR_BUTTON_GPIO_PIN) ==
        GPIO_PIN_RESET) {
      ++activation_counter;
    }
    HAL_Delay(1U);  // 1ms delay
  }
  return activation_counter >= 3;
}

/**
 * Controls power hold pin
 *
 * @param enable  if true sets power hold pin to active state
 */
static inline void power_hold(bool enable) {
  HAL_GPIO_WritePin(PWR_HOLD2_GPIO_PORT, PWR_HOLD2_GPIO_PIN,
                    enable ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

/**
 * Initializes pins related to power management and confirms power on
 */
static void power_pins_init(void) {
  // Initialize nPWR_BUTTON input
  NPWR_BUTTON_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef button_dsc = {.Pin = NPWR_BUTTON_GPIO_PIN,
                                 .Mode = GPIO_MODE_INPUT,
                                 .Pull = GPIO_PULLUP,
                                 .Speed = GPIO_SPEED_HIGH};
  HAL_GPIO_Init(NPWR_BUTTON_GPIO_PORT, &button_dsc);

  // Initialize PWR_HOLD2 output
  PWR_HOLD2_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef hold_dsc = {.Pin = PWR_HOLD2_GPIO_PIN,
                               .Mode = GPIO_MODE_OUTPUT_PP,
                               .Pull = GPIO_NOPULL,
                               .Speed = GPIO_SPEED_HIGH};
  HAL_GPIO_Init(PWR_HOLD2_GPIO_PORT, &hold_dsc);
  power_hold(true);
}

BL_ATTRS((noreturn)) void blsys_wait_power_down(void) {
  // Let's explain the compiler that we need the following loops to be preserved
  volatile int inert = 0;

  // Wait until power button is released if the user still holds it after
  // turning on the device.
  while (power_btn_state()) {
    ++inert;
    (void)inert;
  }

  // Wait for a short press of power button to turn off the device
  while (1) {
    if (power_btn_state()) {
      power_hold(false);
      HAL_Delay(500U);         // Wait for 500ms for the power down
      HAL_NVIC_SystemReset();  // Just reboot the MCU if unsuccessful
      while (1) {              // Should not get there
        ++inert;
        (void)inert;
      }
    }
    ++inert;
    (void)inert;
  }
}

/**
 * Configures system clocks
 *
 * @return true if successful
 */
static bool configure_system_clocks(void) {
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {};

  // Enable Power Control clock
  __HAL_RCC_PWR_CLK_ENABLE();

