cryptoadvance/specter-bootloader/platforms/stm32f469disco/bootloader/bl_syscalls.c
  // The voltage scaling allows optimizing the power consumption when the device
  // is clocked below the maximum system frequency, to update the voltage
  // scaling value regarding system frequency refer to product datasheet.
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  // Enable HSE Oscillator and activate PLL with HSE as source
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
#if defined(USE_STM32469I_DISCO_REVA)
  RCC_OscInitStruct.PLL.PLLM = 25;
#else
  RCC_OscInitStruct.PLL.PLLM = 8;
#endif  // USE_STM32469I_DISCO_REVA
  RCC_OscInitStruct.PLL.PLLN = 360;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  RCC_OscInitStruct.PLL.PLLR = 2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    return false;
  }

  // Activate the OverDrive to reach the 180 MHz Frequency
  if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
    return false;
  }

  // Select PLLSAI output as SD clock source
  PeriphClkInitStruct.PeriphClockSelection =
      RCC_PERIPHCLK_SDIO | RCC_PERIPHCLK_CK48;
  PeriphClkInitStruct.SdioClockSelection = RCC_SDIOCLKSOURCE_CK48;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CK48CLKSOURCE_PLLSAIP;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
  PeriphClkInitStruct.PLLSAI.PLLSAIQ = 7;
  PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV8;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
    return false;
  }

  // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
  // clocks dividers
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
                                 RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
    return false;
  }
  return true;
}

bool blsys_init(void) {
  if (!system_initialized) {
    memset(&ctx, 0, sizeof(ctx));
    ctx.mounted_media = media_none;
    HAL_Init();
    if (!configure_system_clocks()) {
      return false;
    }
    power_pins_init();
    sd_detect_init();
    BSP_LED_Init(ERROR_LED);
    BSP_LED_Off(ERROR_LED);
    gui_init();
#ifdef WRITE_PROTECTION
    // Apply write protection to the Start-up code if needed
    if (!blsys_flash_write_protect(LV_VALUE(_startup_code_start),
                                   LV_VALUE(_startup_code_size), true)) {
      return false;
    }
#endif  // WRITE_PROTECTION
    system_initialized = true;
  }
  return true;
}

void blsys_deinit(void) {
  if (system_initialized) {
    blsys_media_umount();
    BSP_SD_DeInit();
    gui_deinit();
    system_initialized = false;
  }
}

/**
 * Provides accurate delay (in milliseconds) based on SysTick counter flag
 *
 * NOTE: This function is declared as __weak to be overwritten in case of other
 * implementations in user file.
 *
 * @param Delay: specifies the delay time length, in milliseconds.
 */
void HAL_Delay(__IO uint32_t Delay) {
  while (Delay) {
    if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) {
      Delay--;
    }
  }
}

/**
 * Checks if area in flash memory falls in valid address range
 *
 * @param addr  starting address
 * @param size  area size
 * @return      true if successful
 */
static bool check_flash_area(bl_addr_t addr, size_t size) {
  if (addr >= FLASH_WR_BASE && addr <= SIZE_MAX - size &&
      addr + size <= FLASH_WR_BASE + FLASH_WR_SIZE) {
    return true;
  }
  return false;
}

bool blsys_flash_erase(bl_addr_t addr, size_t size) {
  if (size && check_flash_area(addr, size)) {
    bl_addr_t first_s_addr = 0U;
    int first_s_idx = flash_get_sector_info(addr, &first_s_addr, NULL);
    bl_addr_t last_s_addr = 0U;
    bl_addr_t last_s_size = 0U;
    int last_s_idx =
        flash_get_sector_info(addr + size - 1U, &last_s_addr, &last_s_size);
    if (first_s_idx >= 0 && last_s_idx >= first_s_idx && first_s_addr == addr &&
        (addr + size) == (last_s_addr + last_s_size)) {
      if (HAL_OK == HAL_FLASH_Unlock()) {
        __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_);
        FLASH_EraseInitTypeDef erase_cmd = {
            .TypeErase = TYPEERASE_SECTORS,
            .VoltageRange = VOLTAGE_RANGE_3,
            .Sector = first_s_idx,
            .NbSectors = last_s_idx - first_s_idx + 1U,
        };
        uint32_t erase_err = 0;
        int erase_status = HAL_FLASHEx_Erase(&erase_cmd, &erase_err);
        return (HAL_OK == HAL_FLASH_Lock()) && (HAL_OK == erase_status);
      }
    }
  }
  return false;
}

bool blsys_flash_read(bl_addr_t addr, void* buf, size_t len) {
  if (buf && len && check_flash_area(addr, len)) {
    memcpy(buf, (const void*)addr, len);
    return true;
  }
  return false;
}

bool blsys_flash_write(bl_addr_t addr, const void* buf, size_t len) {
  if (buf && len && check_flash_area(addr, len) && sizeof(uint64_t) > 1U) {
    if (HAL_OK == HAL_FLASH_Unlock()) {
      uint32_t curr_addr = (uint32_t)addr;
      const uint8_t* p_buf = buf;
      const uint8_t* p_end = buf + len;
      bool ok = true;

      // Write the first part of data that is not 32-bit aligned
      while (ok && (curr_addr & (sizeof(uint32_t) - 1U)) && p_buf != p_end) {
        ok = ok &&
             (HAL_OK == HAL_FLASH_Program(FLASH_TYPEPROGRAM_BYTE, curr_addr++,
                                          (uint64_t)*p_buf++));
      }

      // Write the middle part of data, aligned to 32-bit boundary
      size_t rm_words = (p_end - p_buf) >> 2;
      while (ok && rm_words) {
        ok = ok &&
             (HAL_OK == HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, curr_addr,
                                          *(const uint32_t*)p_buf));
        curr_addr += sizeof(uint32_t);
        p_buf += sizeof(uint32_t);
        --rm_words;
      }

