cryptoadvance/specter-bootloader/platforms/stm32f469disco/bootloader/bl_syscalls.c
      // Write the last part of data that is not 64-bit aligned
      while (ok && p_buf != p_end) {
        ok = ok &&
             (HAL_OK == HAL_FLASH_Program(FLASH_TYPEPROGRAM_BYTE, curr_addr++,
                                          (uint64_t)*p_buf++));
      }

      return (HAL_OK == HAL_FLASH_Lock()) && ok &&
             bl_memeq((const void*)addr, buf, len);
    }
  }
  return false;
}

bool blsys_flash_crc32(uint32_t* p_crc, bl_addr_t addr, size_t len) {
  if (p_crc && len && check_flash_area(addr, len)) {
    *p_crc = crc32_fast((const void*)addr, len, *p_crc);
    return true;
  }
  return false;
}

/**
 * Creates a new iterator over flash memory sectors
 *
 * @param addr  starting address
 * @param size  size of the area in bytes
 * @return      iterator
 */
static inline flash_sect_iter_t flash_sect_iter(bl_addr_t addr, size_t size) {
  return (flash_sect_iter_t){.addr = addr, .size = size};
}

/**
 * Iterates over flash sectors within defined area in flash memory
 *
 * Before the first call the variable pinted by *p_iter* must be initialized
 * with valid starting address and area size by calling flash_sect_iter().
 *
 * @param p_iter  pointer to externally stored state variable, updated
 * @return         iteration result:
 *                   * >= 0 - number of the next sector
 *                   * -1 - there are no more sectors or in case of failure
 */
static int flash_next_sector(flash_sect_iter_t* p_iter) {
  if (p_iter && p_iter->size) {
    bl_addr_t start_addr = 0U;
    bl_addr_t size = 0U;
    int sector = flash_get_sector_info(p_iter->addr, &start_addr, &size);
    if (sector >= 0 && start_addr == p_iter->addr && size <= p_iter->size) {
      p_iter->addr += size;
      p_iter->size -= size;
      return sector;
    }
  }
  return -1;
}

/**
 * Returns bit map of flash memory sectors within the given area
 *
 * This function returns a bit map of flash sectors where each bit
 * corresponds to flash sector with the same number.
 *
 * @param p_map  pointer to destination structure receiving the sector map
 * @param addr   starting address
 * @param size   area size
 * @return       result:
 *                 * >= 0 - bit map of flash sectors
 *                 * -1 - failed
 */
static bool flash_sector_bitmap(sec_bitmap_t* p_bitmap, bl_addr_t addr,
                                size_t size) {
  if (p_bitmap && size) {
    sec_bitmap_t bitmap = 0;
    const int max_sector = sizeof(bitmap) * 8U - 1U;

    flash_sect_iter_t iter = flash_sect_iter(addr, size);
    int sector = flash_next_sector(&iter);
    while (sector >= 0) {
      sec_bitmap_t sect_bit = (sec_bitmap_t)1U << sector;
      if (sector > max_sector || !IS_OB_WRP_SECTOR(sect_bit)) {
        return false;
      }
      bitmap |= sect_bit;
      sector = flash_next_sector(&iter);
    }
    *p_bitmap = bitmap;
    return true;
  }
  return false;
}

/**
 * Returns state of write protection as a bitmap of sectors
 *
 * In resulting bitmap each bit holds write protection state of corresponding
 * sector: 0 - disabled, 1 - enabled.
 *
 * This function returns false if PCROP is enabled.
 *
 * @param p_sect_bitmap  pointer to variable receiving bitmap of sectors
 * @return               true if successful
 */
static bool flash_get_write_protection_state(sec_bitmap_t* p_sect_bitmap) {
  const uint32_t mask = (1U << FLASH_BANK2_FIRST_SECTOR) - 1U;
  if (p_sect_bitmap) {
    FLASH_OBProgramInitTypeDef config = {0};
    HAL_FLASHEx_OBGetConfig(&config);
    if ((config.OptionType & OPTIONBYTE_WRP) &&
        !(config.WRPSector & FLASH_SPRMOD_BIT)) {
      uint32_t bank1_sectors = (config.WRPSector & mask) ^ mask;
      uint32_t bank2_sectors = (HAL_FLASHEx_OB_GetBank2WRP() & mask) ^ mask;
      *p_sect_bitmap = bank1_sectors | ((sec_bitmap_t)bank2_sectors
                                        << FLASH_BANK2_FIRST_SECTOR);
      return true;
    }
  }
  return false;
}

/**
 * Enables or disables write protection of a flash memory bank
 *
 * In the bitmap of sectors each bit corresponds to a flash memory sector, e.g.
 * bit 0 corresponds to sector 0.
 *
 * @param sect_bitmap  bitmap of sectors that needs to be re-configured
 * @param enable       protection state:
 *                       * true - write protection is enabled
 *                       * false - write protection is disabled
 * @return             true if successful
 */
static bool flash_set_write_protection_state(sec_bitmap_t sect_bitmap,
                                             bool enable) {
  const sec_bitmap_t mask = (1U << FLASH_BANK2_FIRST_SECTOR) - 1U;

  // Unlock access to flash memory and option bytes
  bool ok = (HAL_OK == HAL_FLASH_Unlock());
  ok = ok && (HAL_OK == HAL_FLASH_OB_Unlock());

  // Program Bank 2
  FLASH_OBProgramInitTypeDef config = {
      .OptionType = OPTIONBYTE_WRP,
      .WRPState = enable ? OB_WRPSTATE_ENABLE : OB_WRPSTATE_DISABLE,
      .WRPSector = sect_bitmap & (mask << FLASH_BANK2_FIRST_SECTOR),
      .Banks = FLASH_BANK_2};
  ok = ok && (HAL_OK == HAL_FLASHEx_OBProgram(&config));

  // Program Bank 1
  config = (FLASH_OBProgramInitTypeDef){
      .OptionType = OPTIONBYTE_WRP,
      .WRPState = enable ? OB_WRPSTATE_ENABLE : OB_WRPSTATE_DISABLE,
      .WRPSector = sect_bitmap & mask,
      .Banks = FLASH_BANK_1};
  ok = ok && (HAL_OK == HAL_FLASHEx_OBProgram(&config));

  // Request reloading of option bytes
  ok = ok && (HAL_OK == HAL_FLASH_OB_Launch());

  // Lock access to flash memory and option bytes
  ok = ok && (HAL_OK == HAL_FLASH_OB_Lock());
  ok = ok && (HAL_OK == HAL_FLASH_Lock());
  return ok;
}

/**
 * Enables or disables write protection for all sectors of the flash memory
 *
 * @param enable       protection state:
 *                       * true - write protection is enabled
 *                       * false - write protection is disabled
 * @return             true if successful
 */
static bool flash_set_write_protection_state_global(bool enable) {
  // Unlock access to flash memory and option bytes
  bool ok = (HAL_OK == HAL_FLASH_Unlock());
  ok = ok && (HAL_OK == HAL_FLASH_OB_Unlock());

