cryptoadvance/specter-bootloader/platforms/stm32f469disco/bootloader/bl_syscalls.c
  // Program both Banks
  FLASH_OBProgramInitTypeDef config = {
      .OptionType = OPTIONBYTE_WRP,
      .WRPState = enable ? OB_WRPSTATE_ENABLE : OB_WRPSTATE_DISABLE,
      .WRPSector = OB_WRP_SECTOR_All,
      .Banks = FLASH_BANK_BOTH};
  ok = ok && (HAL_OK == HAL_FLASHEx_OBProgram(&config));

  // Request reloading of option bytes
  ok = ok && (HAL_OK == HAL_FLASH_OB_Launch());

  // Lock access to flash memory and option bytes
  ok = ok && (HAL_OK == HAL_FLASH_OB_Lock());
  ok = ok && (HAL_OK == HAL_FLASH_Lock());
  return ok;
}

/**
 * Returns RDP (read protection) level
 *
 * @param p_rdp_level  pointer to variable receiving RDP level, a value of
 *                     @ref FLASHEx_Option_Bytes_Read_Protection
 * @return             true if successful
 */
bool flash_get_rdp_level(uint32_t* p_rdp_level) {
  if (p_rdp_level) {
    FLASH_OBProgramInitTypeDef config = {0};
    HAL_FLASHEx_OBGetConfig(&config);
    if ((config.OptionType & OPTIONBYTE_RDP)) {
      *p_rdp_level = config.RDPLevel;
      return true;
    }
  }
  return false;
}

/**
 * Programs read protection level
 *
 * WARNING: Programming Level 2 (OB_RDP_LEVEL_2) is irreversible!
 *
 * @param rdp_level  requited read protection level, a value of
 *                   @ref FLASHEx_Option_Bytes_Read_Protection
 * @return           true if successful
 */
bool flash_set_rdp_level(uint32_t rdp_level) {
  if (IS_OB_RDP_LEVEL(rdp_level)) {
    // Unlock access to flash memory and option bytes
    bool ok = (HAL_OK == HAL_FLASH_Unlock());
    ok = ok && (HAL_OK == HAL_FLASH_OB_Unlock());

    // Program option byte(s)
    FLASH_OBProgramInitTypeDef config = {.OptionType = OPTIONBYTE_RDP,
                                         .RDPLevel = rdp_level};
    ok = ok && (HAL_OK == HAL_FLASHEx_OBProgram(&config));

    // Request reloading of option bytes
    ok = ok && (HAL_OK == HAL_FLASH_OB_Launch());

    // Lock access to flash memory and option bytes
    ok = ok && (HAL_OK == HAL_FLASH_OB_Lock());
    ok = ok && (HAL_OK == HAL_FLASH_Lock());
    return ok;
  }
  return false;
}

bool blsys_flash_write_protect(bl_addr_t addr, size_t size, bool enable) {
  sec_bitmap_t sect_map = 0U;
  if (flash_sector_bitmap(&sect_map, addr, size)) {
    uint32_t rdp_level = OB_RDP_LEVEL_0;
    sec_bitmap_t curr_state = 0U;
    bool ok = flash_get_rdp_level(&rdp_level);
    ok = ok && flash_get_write_protection_state(&curr_state);
    // We don't try to modify write protection bits in RDP Level 2
    if (ok && rdp_level != OB_RDP_LEVEL_2) {
      sec_bitmap_t new_state = curr_state;
      if (enable) {
        new_state |= sect_map;
      } else {
        new_state &= ~sect_map;
      }
      // Check if we need to re-program bits for Bank 1
      if (new_state != curr_state) {
        ok = ok && flash_set_write_protection_state(sect_map, enable);
        // Verify that configuration is programmed successfully
        ok = ok && flash_get_write_protection_state(&curr_state);
        ok = ok && curr_state == new_state;
      }
#ifdef DEBUG
      bl_keep_variable(&sect_map);
      bl_keep_variable(&rdp_level);
      bl_keep_variable(&new_state);
#endif
    }
    return ok;
  }
  return false;
}

bool blsys_flash_read_protect(int level_) {
  uint32_t new_rdp_level = OB_RDP_LEVEL_0;
  switch (level_) {
    case 1:
      new_rdp_level = OB_RDP_LEVEL_1;
      break;
#if 0  // RDP Level 2 is intentionally disabled. If misused may brick your
       // board!
    case 2:
      new_rdp_level = OB_RDP_LEVEL_2;
      break;
#endif
    default:
      return false;
  }

  uint32_t curr_rdp_level = OB_RDP_LEVEL_0;
  bool ok = flash_get_rdp_level(&curr_rdp_level);
  if (curr_rdp_level != new_rdp_level) {
    if (OB_RDP_LEVEL_2 == new_rdp_level) {
      // Remove write protection from all the sectors because option bytes
      // become unmodifiable after enabling RDP Level 2.
      ok = ok && flash_set_write_protection_state_global(false);
#ifdef WRITE_PROTECTION
      // Re-apply write protection to the Start-up code
      ok = ok && blsys_flash_write_protect(LV_VALUE(_startup_code_start),
                                           LV_VALUE(_startup_code_size), true);
#endif  // WRITE_PROTECTION
    }
    ok = ok && flash_set_rdp_level(new_rdp_level);
    ok = ok && flash_get_rdp_level(&curr_rdp_level);
    ok = ok && curr_rdp_level == new_rdp_level;
    if (ok) {
      // Reboot the MCU if successful
      HAL_NVIC_SystemReset();
    }
  }
  return ok;
}

int blsys_flash_get_read_protection_level(void) {
  uint32_t curr_rdp_level = OB_RDP_LEVEL_0;
  if (flash_get_rdp_level(&curr_rdp_level)) {
    switch (curr_rdp_level) {
      case OB_RDP_LEVEL_0:
        return 0;
      case OB_RDP_LEVEL_1:
        return 1;
      case OB_RDP_LEVEL_2:
        return 2;
      default:
        return -1;
    }
  }
  return -1;
}

uint32_t blsys_media_devices(void) { return media_n_devices; }

const char* blsys_media_name(uint32_t device_idx) {
  static const char* invalid = "<invalid>";
  if (device_idx < media_n_devices && media_name[device_idx]) {
    return media_name[device_idx];
  }
  return invalid;
}

bool blsys_media_check(uint32_t device_idx) {
  if (media_micro_sd == device_idx) {
    return sd_detect_state();
  }
  return false;
}

bool blsys_media_mount(uint32_t device_idx) {
  if (media_micro_sd == device_idx) {
    if (sd_detect_state()) {
      if (media_none == ctx.mounted_media) {
        if (FATFS_LinkDriver(&SD_Driver, ctx.media_path) == 0 &&
            f_mount(&ctx.fs_obj, (TCHAR const*)ctx.media_path, 0) == FR_OK) {
          ctx.mounted_media = media_micro_sd;
        }
      }
      return media_micro_sd == ctx.mounted_media;
    }
  }
  return false;
}

void blsys_media_umount(void) {
  if (media_micro_sd == ctx.mounted_media) {
    (void)f_mount(0, "", 0);  // Unmount the default drive
    (void)FATFS_UnLinkDriver(ctx.media_path);
  }
  ctx.mounted_media = media_none;
}

/**
 * Handles GUI failure rebooting the device
 */
BL_ATTRS((noreturn)) static void handle_gui_fail(void) {
  BSP_LED_On(ERROR_LED);
  HAL_Delay(2000U);
  HAL_NVIC_SystemReset();
  blsys_wait_power_down();
}

BL_ATTRS((noreturn)) void blsys_fatal_error(const char* text) {
  blsys_media_umount();
  blsys_deinit();
  BSP_LED_On(ERROR_LED);
  if (!gui_show_alert(bl_alert_error, "Bootloader Error", text,
                      REBOOT_PROMPT)) {
    handle_gui_fail();
  }
  blsys_wait_power_down();
}

bl_alert_status_t blsys_alert(blsys_alert_type_t type, const char* caption,
                              const char* text, uint32_t time_ms,
                              uint32_t flags) {
  if (!gui_show_alert(type, caption, text,
                      BL_FOREVER == time_ms ? REBOOT_PROMPT : NULL)) {
    handle_gui_fail();
  }

  if (BL_FOREVER == time_ms) {
    blsys_wait_power_down();
  }

  HAL_Delay(time_ms);
  return bl_alert_terminated;
}

void blsys_progress(const char* caption, const char* operation,
                    uint32_t percent_x100) {
  if (!gui_update_progress(caption, operation, percent_x100)) {
    blsys_fatal_error("Unable to update the progress bar");
  }
}

/**
 * Starts the firmware from given address in the flash memory
 *
 * @param start_addr  start address of the firmware in flash memory
 * @param argument    argument passed to the executable module
 * @return            false in case of failure, otherwise the function does not
 *                    return
 */
static bool start_firmware(bl_addr_t start_addr, uint32_t argument) {
  // At the moment only execution of the Main Firmware is allowed
  if (bl_flash_map[bl_flash_firmware_base] == start_addr) {
    // Get pointer to vector table and check that it is valid
    volatile uint32_t* vectors = (volatile uint32_t*)start_addr;
    uint32_t msp = vectors[0];
    uint32_t entry_addr = vectors[1];
    void (*entry)(uint32_t) = (void (*)(uint32_t))entry_addr;

    // Check if valid firmware present at given address
    if (msp != 0xFFFFFFFFU &&
        entry_addr > bl_flash_map[bl_flash_firmware_base] &&
        entry_addr < (bl_flash_map[bl_flash_firmware_base] +
                      bl_flash_map[bl_flash_firmware_size])) {
      // Disable all interrupts
      __disable_irq();

      // Remap Main Flash memory to 0x00000000 using SYSCFG
      __DSB();
      __ISB();
      __HAL_SYSCFG_REMAPMEMORY_FLASH();
      __DSB();
      __ISB();

