cryptoadvance/specter-bootloader/platforms/stm32f469disco/bootloader/bl_syscalls.c
      // Remap the vector table
      SCB->VTOR = start_addr;

      // Start the firmware
      __set_MSP(msp);
      __enable_irq();  // MicroPython expects that interrupts are enabled
      entry(argument);

      // Should not get there
      while (1) {
        __asm volatile(" nop");
      }
    }
  }
  return false;
}

bool blsys_start_firmware(bl_addr_t start_addr, uint32_t argument) {
  // Calculate physical address of start_firmware() in RAM
  blsys_start_firmware_t start_fn = (blsys_start_firmware_t)(
      (uintptr_t)&start_firmware + (uintptr_t)&_ram_code_start);

  // De-initialize the hardware
  blsys_deinit();
  BSP_LCD_Reset();

  // Start the firmware
  return start_fn(start_addr, argument);
}

/*
 * Flash sector mapping is taken from the MicroPython project,
 * http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */